In [20]:
import pandas as pd

In [21]:
dados = {
    "Nome": ["Taynan", "Luigi", "Samuel", "Ágata"],
    "idade": [98, 81, 103, 100],
    "Cidade": ["São Paulo", "Tokio", "Rio de Janeiro", "Paris" ]
}

In [22]:
Dataframe = pd.DataFrame(dados)

In [23]:
Dataframe

     Nome  idade          Cidade
0  Taynan     98       São Paulo
1   Luigi     81           Tokio
2  Samuel    103  Rio de Janeiro
3   Ágata    100           Paris

In [24]:
#exibir o primeiro elemento 
Dataframe.head(1)

     Nome  idade     Cidade
0  Taynan     98  São Paulo

In [25]:
Dataframe.tail(2)

     Nome  idade          Cidade
2  Samuel    103  Rio de Janeiro
3   Ágata    100           Paris

In [26]:
dados_notas_disciplinas = {
    "Nomes": ["Alice", "Bob", "Osama", "David", "Eva", "Charlie"],
    "Matemática":[85,90,95,78,88,92],
    "Física": [48,38,99,75,90,78],
    "Química": [84,65,100,41,89,65]
}

In [27]:
df_notas = pd.DataFrame(dados_notas_disciplinas)

In [28]:
df_notas

     Nomes  Matemática  Física  Química
0    Alice          85      48       84
1      Bob          90      38       65
2    Osama          95      99      100
3    David          78      75       41
4      Eva          88      90       89
5  Charlie          92      78       65